{
  "locales" : [
    {
      "code" : "pl_PL",
      "displayName" : "Polski <i class='fa-solid fa-earth-europe'></i>",
      "contact" : "Kontakt",
      "graphicsCalculator" : "Kalkulator graficzny",
      "graphicsCalculatorDesc" : "Proste narzędzie do rysowania funkcji matematycznych z dodatkami do edycji graficznej.",
      "graphicsCalculatorDemo": "Zobacz demo!",
      "calendar" : "Kalendarz",
      "calendarDesc" : "Prosty kalendarz stworzony przy użyciu js i bootstrapa.",
      "calendarDemo" : "Zobacz projekt!",
      "authSystem" : "System autoryzacji",
      "authSystemDesc" : "Wtyczka dodająca logowanie na serwery minecraft. Napisana w javie w oparciu o api bukkita. Aplikacja w pełni konfigurowalna, ze wsparciem dla internacjonalizacji. Oparta o moduły, które można włączać/wyłączac w czasie rzeczywistym.",
      "authDemo" : "Zobacz projekt!",
      "audioPlayer" : "Cyfrowy odtwarzacz muzyki",
      "audioPlayerDesc" : "odtwarzacz audio z ekranem lcd zbudowany na mikrokontrolerze esp32 z procesorem dźwiękowym tda8425 i końcówką mocy tda7377. Oparty o oprogramowanie napisane w C++.",
      "audioPlayerDemo1" : "Prezentacja 1",
      "audioPlayerDemo2" : "Prezentacja 2",
      "knownTechnologies" : "Technologie jakich używam:",
      "java" : "Java",
      "javaDesc" : "Język od którego zacząłem pasję do programowania. 5 Letnie hobbistyczne doświadcznenie na poziomie junior/mid developer. Głównie zajmowałem się tworzeniem serwerów do gry Minecraft, w tym własnej implementacji silnika serwera.",
      "js" : "JavaScript",
      "jsDesc" : "Roczne doświadczenie, sprawnie posługuję się tym językiem. Aplikacje, jakie tworzyłem w tym języku to m.in. kalkulator graficzny i aplikacja do sterowania mikrokontrolerem przy użyciu strony internetowej.",
      "bootstrap" : "Bootstrap",
      "bootstrapDesc" : "Biblioteka, którą poznałem stosunkowo niedawno, aczkolwiek wykonałem przy użyciu niej wiele projektów, w tym tą stronę. Mimo krótkiego stażu ok. 2 miesiące radze sobię bardzo sprawnie.",
      "php" : "PHP",
      "phpDesc" : "Język, który poznałem ucząc się do egzaminów zawodowych. Mimo małego doswiadczenia poruszam się w nim sprawnie, dzięki dobrej znajomości innych języków obiektowych takich jak Java/CPP.",
      "frontendProgrammer" : "Programista front-end",
      "frontendProgrammerDesc" : "Jeżeli chodzi o programowanie front-endowe to dopiero zaczynam swoją przygodę. Jednak wydaje mi się, że radzę sobie dobrze. Co widać po tej stronie i kilku innych moich projektach.",
      "aboutMe" : "O mnie:",
      "aboutMeDesc" : "Jestem 19 letnim, pracowitym i nastawionym na rozwój chłopakiem. Moją pasja jest programowanie. Zajmuje się tym od 14 roku życia. Oprócz programowania interesuje się elektroniką, gdzie pierwsze obwody tworzyłem mając 11 lat. Jeżeli chodzi o prace jako programista, to prócz kilku małych zleceń nie miałem w tym doświadczenia.",
      "backendProgrammer" : "Programista back-end",
      "backendProgrammerDesc" : "Programowaniem back-endowym zajmuje się już dosyć długi czas. Pierwsze swoje kroki stawiałem pisząc wtyczki do serwerów minecrafta w javie, po jakims czasie stworzyłem własną implementacje silnika serwera, po którego stronie leży cała logika gry. Również tworzyłem oprogramowanie do odtwarzacza muzyki w C++ zbudowanym na mikrokontrolerze esp32.",
      "theEnd" : "NA KONIEC",
      "theEndDesc" : "Na ten moment nie uważam siebie za doświadczonego programistę. Jednak myślę, że nasza współpraca może być owocna. Jestem rzetelny i pracowity, również nie lubię owijania w bawełnę, wiec każdy projekt, którego się podejmę będę tworzył dając z siebie 100%, a jeśli uznam, że nie jestem w stanie czegoś stworzyć powiem to na wstępie, aby uszanować nasz wspólny czas.",
      "sources" : "ŹRÓDŁA",
      "contactUpper" : "KONTAKT",
      "socialMedia" : "SOCIAL MEDIA",
      "madeBy" : "Wykonanie: Seweryn Skrzypik"

    },

    {
      "code" : "en_EN",
      "displayName" : "English <i class='fa-solid fa-earth-americas'></i>",
      "contact" : "Contact",
      "graphicsCalculator" : "Graphics calculator",
      "graphicsCalculatorDesc" : "A simple tool for drawing math functions. With addons to graphic editing.",
      "graphicsCalculatorDemo": "Play demo!",
      "calendar" : "Calendar",
      "calendarDesc" : "A simple calendar created using js and bootstrap.",
      "calendarDemo" : "Check it out!",
      "authSystem" : "Authorization system",
      "authSystemDesc" : "A minecraft servers plugin that adds authorizations. It is written in java using the bukkit api. Fully customizable application with multilingual support. Based on modules that can be enabled/disabled in real time.",
      "authDemo" : "Check it out!",
      "audioPlayer" : "Digital music player",
      "audioPlayerDesc" : "Audio player with lcd screen. Built on esp32 microcontroller with tda8425 sound processor and tda7377 power amplifier. Based on software written in C++.",
      "audioPlayerDemo1" : "Presentation 1",
      "audioPlayerDemo2" : "Presentation 2",
      "knownTechnologies" : "Technologies I use:",
      "java" : "Java",
      "javaDesc" : "5 years of hobby experience at junior/mid developer level. I mainly dealt with creating servers for Minecraft, including my own implementation of the server engine. Currently, there is nothing that I have not created with this language. Obviously better or worse.",
      "js" : "JavaScript",
      "jsDesc" : "<br>Short experience (1) year but I'm good at it. Applications that I have created in this language include: graphing calculator and microcontroller control application using website.",
      "bootstrap" : "Bootstrap",
      "bootstrapDesc" : "<br>A library that I got to know relatively recently, however I have made many projects using it, including this website. Despite the short experience of about 2 months, I`m great at that.",
      "php" : "PHP",
      "phpDesc" : "The coding language I learned while studying for professional exams. Despite my little experience, I am good in it, thanks to my good knowledge of other object-oriented languages ​​such as Java/CPP.",
      "frontendProgrammer" : "Front-end developer",
      "frontendProgrammerDesc" : "When it comes to front-end programming, I'm just starting my adventure. However, I seem to be doing fine. As you can see on this page and some of my other projects.",
      "aboutMe" : "About me:",
      "aboutMeDesc" : "I`m 19 year old, hard working and ambitious student. My passion is programming. I started it when I was 14. In addition to programming. I`m interested in electronics, where I created my first circuits when I was 11 years old. When it comes to working as a programmer, apart from a few small jobs. I had no experience in it.",
      "backendProgrammer" : "Back-end developer",
      "backendProgrammerDesc" : "Back-end development I learning for quite a long time. I took my first steps by writing plugins for minecraft servers in java, after some time I created my own implementation of the server engine, on whose side the entire logic of the game. I also developed software for a music player in C++ built on an esp32 microcontroller.",
      "theEnd" : "THE END",
      "theEndDesc" : "I`m not sure I`m an experienced programmer at the moment. However, I think our cooperation will be successful. I am honest and hardworking and I don't like wasting time. So every project I undertake I will do it giving 100% of myself. If I decide that I am unable to create something, I will say it at the beginning to save our time.",
      "sources" : "SOURCES",
      "contactUpper" : "KEEP IN TOUCH",
      "socialMedia" : "SOCIAL MEDIA",
      "madeBy" : "designed by: Seweryn Skrzypik"
    }
  ]
}